/**
 * Copyright (C), 2018-2022
 * FileName: RandomNameUtils
 * Author:   lihui
 * Date:     2022/8/2 11:30
 * Description:
 * History:
 * <author>          <time>          <version>          <desc>
 * 作者姓名           修改时间           版本号              描述
 */
package com.ximalife.library.util;

import java.io.UnsupportedEncodingException;
import java.util.Random;

/**
 * 随机取名
 */
public class RandomNameUtils {
    /**
     * 随机获取姓名
     *
     * @return
     */
    public static String fullName() {
        return surname() + name(2);
    }

    /**
     * 随机获取姓
     *
     * @return
     */
    public static String surname() {
        return SURNAME[new Random().nextInt(SURNAME.length - 1)];
    }

    /**
     * 获取N位常用字
     *
     * @param len
     * @return
     */
    public static String name(int len) {
        StringBuilder ret = new StringBuilder();
        for (int i = 0; i < len; i++) {
            String str = null;
            // 定义高低位
            int highPos, lowPos;
            Random random = new Random();
            //获取高位值
            highPos = (176 + Math.abs(random.nextInt(39)));
            //获取低位值
            lowPos = (161 + Math.abs(random.nextInt(93)));
            byte[] b = new byte[2];
            b[0] = (new Integer(highPos).byteValue());
            b[1] = (new Integer(lowPos).byteValue());
            try {
                //转成中文
                str = new String(b, "GBK");
            } catch (UnsupportedEncodingException ex) {
                ex.printStackTrace();
            }
            ret.append(str);
        }
        return ret.toString();
    }

    /**
     * 2021年姓排行100
     */
    private final static String[] SURNAME = {
            "快乐的", "冷静的", "醉熏的", "潇洒的", "糊涂的", "积极的",
            "冷酷的", "深情的", "粗暴的", "温柔的", "可爱的", "愉快的",
            "义气的", "认真的", "威武的", "帅气的", "传统的", "潇洒的",
            "漂亮的", "自然的", "专一的", "听话的", "昏睡的", "狂野的",
            "等待的", "搞怪的", "幽默的", "魁梧的", "活泼的", "开心的",
            "高兴的", "超帅的", "留胡子的", "坦率的", "直率的", "轻松的",
            "痴情的", "完美的", "精明的", "无聊的", "有魅力的", "丰富的",
            "繁荣的", "饱满的", "炙热的", "暴躁的", "碧蓝的", "俊逸的",
            "英勇的", "健忘的", "故意的", "无心的", "土豪的", "朴实的",
            "兴奋的", "幸福的", "淡定的", "不安的", "阔达的", "孤独的",
            "独特的", "疯狂的", "时尚的", "落后的", "风趣的", "忧伤的",
            "大胆的", "爱笑的", "矮小的", "健康的", "合适的", "玩命的",
            "沉默的", "斯文的", "香蕉", "苹果", "鲤鱼", "鳗鱼", "任性的",
            "细心的", "粗心的", "大意的", "甜甜的", "酷酷的", "健壮的",
            "英俊的", "霸气的", "阳光的", "默默的", "大力的", "孝顺的",
            "忧虑的", "着急的", "紧张的", "善良的", "凶狠的", "害怕的",
            "重要的", "危机的", "欢喜的", "欣慰的", "满意的", "跳跃的",
            "诚心的", "称心的", "如意的", "怡然的", "娇气的", "无奈的",
            "无语的", "激动的", "愤怒的", "美好的", "感动的", "激情的",
            "激昂的", "震动的", "虚拟的", "超级的", "寒冷的", "明理的",
            "犹豫的", "忧郁的", "寂寞的", "奋斗的", "勤奋的", "现代的",
            "过时的", "稳重的", "热情的", "含蓄的", "无辜的", "多情的",
            "纯真的", "拉长的", "热心的", "从容的", "体贴的", "风中的",
            "曾经的", "追寻的", "儒雅的", "优雅的", "开朗的", "外向的",
            "内向的", "清爽的", "文艺的", "长情的", "平常的", "单身的",
            "伶俐的", "高大的", "懦弱的", "柔弱的", "爱笑的", "乐观的",
            "耍酷的", "酷炫的", "神勇的", "年轻的", "唠叨的", "瘦瘦的",
            "无情的", "包容的", "顺心的", "畅快的", "舒适的", "靓丽的",
            "负责的", "背后的", "简单的", "谦让的", "彩色的", "缥缈的",
            "欢呼的", "生动的", "复杂的", "慈祥的", "仁爱的", "魔幻的",
            "虚幻的", "淡然的", "受伤的", "雪白的", "高高的", "糟糕的",
            "顺利的", "闪闪的", "羞涩的", "缓慢的", "迅速的", "优秀的",
            "聪明的", "含糊的", "俏皮的", "淡淡的", "坚强的", "平淡的",
            "欣喜的", "能干的", "灵巧的", "友好的", "机智的", "机灵的",
            "正直的", "谨慎的", "俭朴的", "殷勤的", "虚心的", "辛勤的",
            "自觉的", "无私的", "无限的", "踏实的", "老实的", "现实的",
            "可靠的", "务实的", "拼搏的", "个性的", "粗犷的", "活力的",
            "成就的", "勤劳的", "单纯的", "落寞的", "朴素的", "悲凉的",
            "忧心的", "洁净的", "清秀的", "自由的", "小巧的", "单薄的",
            "贪玩的", "刻苦的", "干净的", "壮观的", "和谐的", "文静的",
            "调皮的", "害羞的", "安详的", "自信的", "端庄的", "坚定的",
            "美满的", "舒心的", "温暖的", "专注的", "勤恳的", "美丽的",
            "腼腆的", "优美的", "甜美的", "甜蜜的", "整齐的", "动人的",
            "典雅的", "尊敬的", "舒服的", "妩媚的", "秀丽的", "喜悦的",
            "甜美的", "彪壮的", "强健的", "大方的", "俊秀的", "聪慧的",
            "迷人的", "陶醉的", "悦耳的", "动听的", "明亮的", "结实的",
            "魁梧的", "标致的", "清脆的", "敏感的", "光亮的", "大气的",
            "老迟到的", "知性的", "冷傲的", "呆萌的", "野性的", "隐形的",
            "笑点低的", "微笑的", "笨笨的", "难过的", "沉静的", "火星上的",
            "失眠的", "安静的", "纯情的", "要减肥的", "迷路的", "烂漫的",
            "哭泣的", "贤惠的", "苗条的", "温婉的", "发嗲的", "会撒娇的",
            "贪玩的", "执着的", "眯眯眼的", "花痴的", "想人陪的", "眼睛大的",
            "高贵的", "傲娇的", "心灵美的", "爱撒娇的", "细腻的", "天真的",
            "怕黑的", "感性的", "飘逸的", "怕孤独的", "忐忑的", "高挑的",
            "傻傻的", "冷艳的", "爱听歌的", "还单身的", "怕孤单的", "懵懂的",
            "平", "刚", "杰", "桂英", "芳", "嘉懿", "煜城", "懿轩", "烨伟", "苑博", "伟泽",
            "熠彤", "鸿煊", "博涛", "烨霖", "烨华", "煜祺", "智宸", "正豪", "昊然", "明杰",
            "立诚", "立轩", "立辉", "峻熙", "弘文", "熠彤", "鸿煊", "烨霖", "哲瀚", "鑫鹏",
            "致远", "俊驰", "雨泽", "烨磊", "晟睿", "天佑", "文昊", "修洁", "黎昕", "远航",
            "旭尧", "鸿涛", "伟祺", "荣轩", "越泽", "浩宇", "瑾瑜", "皓轩", "擎苍", "擎宇",
            "志泽", "睿渊", "楷瑞", "子轩", "弘文", "哲瀚", "雨泽", "鑫磊", "修杰", "伟诚",
            "建辉", "晋鹏", "天磊", "绍辉", "泽洋", "明轩", "健柏", "鹏煊", "昊强", "伟宸",
            "博超", "君浩", "子骞", "明辉", "鹏涛", "炎彬", "鹤轩", "越彬", "风华", "靖琪",
            "明诚", "高格", "光华", "国源", "冠宇", "晗昱", "涵润", "翰飞", "翰海", "昊乾",
            "浩博", "和安", "弘博", "宏恺", "鸿朗", "华奥", "华灿", "嘉慕", "坚秉", "建明",
            "金鑫", "锦程", "瑾瑜", "晋鹏", "经赋", "景同", "靖琪", "君昊", "俊明", "季同",
            "开济", "凯安", "康成", "乐语", "力勤", "良哲", "理群", "茂彦", "敏博", "明达",
            "朋义", "彭泽", "鹏举", "濮存", "溥心", "璞瑜", "浦泽", "奇邃", "祺祥", "荣轩",
            "锐达", "睿慈", "绍祺", "圣杰", "晟睿", "思源", "斯年", "泰宁", "天佑", "同巍",
            "奕伟", "祺温", "文虹", "向笛", "心远", "欣德", "新翰", "兴言", "星阑", "修为",
            "旭尧", "炫明", "学真", "雪风", "雅昶", "阳曦", "烨熠", "英韶", "永贞", "咏德",
            "宇寰", "雨泽", "玉韵", "越彬", "蕴和", "哲彦", "振海", "正志", "子晋", "自怡",
            "德赫", "君平"};
}
